IDENTIFICATION DIVISION. *> Compile and run with cobc -std=cobol2014 --free -x day2.cbl && ./day2
PROGRAM-ID. DAY2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DAY2DATA ASSIGN TO INPUT
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD DAY2DATA.
    01 GAME PIC X(99).

WORKING-STORAGE SECTION.
01 WS-GAME PIC X(99).
01 WS-COUNTS.
    05 WS-RED PIC 9(3).
    05 WS-GREEN PIC 9(3).
    05 WS-BLUE PIC 9(3).
01 WS-HAND.
    05 WS-COUNT PIC 9(3).
    05 WS-COLOR PIC X(10).
01 WS-GAME-NUM PIC 9(3).
77 WS-EOF PIC A(1).
77 WS-GAME-NUM-LEN PIC 9(3).
77 WS-XXX PIC 999.
77 WS-DONE PIC X.

PROCEDURE DIVISION.
MAIN-PARA.
    OPEN INPUT DAY2DATA.
        PERFORM UNTIL WS-EOF='Y'
            READ DAY2DATA INTO WS-GAME
                AT END MOVE 'Y' TO WS-EOF
                NOT AT END
                PERFORM GAME-PARA
                *>DISPLAY WS-GAME-NUM
            END-READ
        END-PERFORM.
    CLOSE DAY2DATA.
GAME-PARA.
    MOVE ZEROS TO WS-COUNTS
    MOVE ZEROS TO WS-GAME-NUM
    MOVE ZEROS TO WS-GAME-NUM-LEN
    MOVE ZERO TO WS-DONE
    MOVE ZEROS TO WS-XXX
    MOVE ZEROS TO WS-COUNT
    INSPECT WS-GAME TALLYING WS-GAME-NUM-LEN FOR CHARACTERS AFTER INITIAL ' ' BEFORE INITIAL ':'
    MOVE WS-GAME(6:WS-GAME-NUM-LEN) TO WS-GAME-NUM
    PERFORM UNTIL WS-DONE='Y'
        INSPECT WS-GAME(8 + WS-GAME-NUM-LEN:) TALLYING WS-XXX FOR ALL CHARACTERS BEFORE INITIAL ','
        UNSTRING WS-GAME(8 + WS-GAME-NUM-LEN:WS-XXX) DELIMITED BY ' ' INTO WS-COUNT WS-COLOR
        DISPLAY WS-COUNT
        DISPLAY WS-COLOR
        DISPLAY '---'
        MOVE 'Y' TO WS-DONE
    END-PERFORM.
