IDENTIFICATION DIVISION. *> Compile and run with cobc -std=cobol2014 --free -x day2.cbl && ./day2
PROGRAM-ID. DAY2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DAY2DATA ASSIGN TO INPUT
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD DAY2DATA.
    01 GAME PIC X(999).

WORKING-STORAGE SECTION.
01 WS-GAME PIC X(999).
01 WS-POWER.
    05 WS-RED PIC 9(3).
    05 WS-GREEN PIC 9(3).
    05 WS-BLUE PIC 9(3).
01 WS-HAND.
    05 WS-COUNT PIC 9(3).
    05 WS-COLOR PIC X(10).
01 WS-GAME-NUM PIC 9(3).
77 WS-EOF PIC A(1).
77 WS-GAME-NUM-LEN PIC 9(3).
77 WS-XXX PIC 999.
77 WS-DONE PIC X.
77 WS-HAND-POWER PIC 9(8).
77 WS-TOTAL-POWER PIC 9(18).

PROCEDURE DIVISION.
MAIN-PARA.
    MOVE ZEROS TO WS-TOTAL-POWER
    OPEN INPUT DAY2DATA.
        PERFORM UNTIL WS-EOF='Y'
            READ DAY2DATA INTO WS-GAME
                AT END MOVE 'Y' TO WS-EOF
                NOT AT END
                PERFORM GAME-PARA
            END-READ
        END-PERFORM.
    CLOSE DAY2DATA
    DISPLAY WS-TOTAL-POWER
    STOP RUN.
GAME-PARA.
    MOVE ZEROS TO WS-GAME-NUM
    MOVE ZEROS TO WS-GAME-NUM-LEN
    MOVE ZERO TO WS-DONE
    MOVE ZEROS TO WS-COUNT
    MOVE ZEROS TO WS-POWER
    MOVE ZEROS TO WS-HAND-POWER

    INSPECT WS-GAME TALLYING WS-GAME-NUM-LEN FOR CHARACTERS AFTER INITIAL ' ' BEFORE INITIAL ':'
    MOVE WS-GAME(6:WS-GAME-NUM-LEN) TO WS-GAME-NUM
    MOVE WS-GAME(8 + WS-GAME-NUM-LEN:) TO WS-GAME

    PERFORM WITH TEST AFTER UNTIL WS-XXX = LENGTH OF WS-GAME
        MOVE ZEROS TO WS-XXX
        INSPECT WS-GAME REPLACING ALL ';' BY ','
        INSPECT WS-GAME TALLYING WS-XXX FOR CHARACTERS BEFORE INITIAL ','
        UNSTRING WS-GAME(1:WS-XXX) DELIMITED BY ' ' INTO WS-COUNT WS-COLOR

        IF WS-COLOR(1:5) = 'green' AND WS-COUNT > WS-GREEN
            MOVE WS-COUNT TO WS-GREEN
        END-IF
        IF WS-COLOR(1:3) = 'red' AND WS-COUNT > WS-RED
            MOVE WS-COUNT TO WS-RED
        END-IF
        IF WS-COLOR(1:4) = 'blue' AND WS-COUNT > WS-BLUE
            MOVE WS-COUNT TO WS-BLUE
        END-IF

        MOVE WS-GAME(WS-XXX + 3:) TO WS-GAME
    END-PERFORM

    COMPUTE WS-HAND-POWER = WS-BLUE * WS-GREEN * WS-RED
    DISPLAY WS-GAME-NUM ' ' WS-HAND-POWER
    ADD WS-HAND-POWER TO WS-TOTAL-POWER.
