IDENTIFICATION DIVISION. *> Compile and run with cobc -std=cobol2014 --free -x day4.cbl -j
PROGRAM-ID. DAY4.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DAY4DATA ASSIGN TO INPUT
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD DAY4DATA RECORD CONTAINS 48 CHARACTERS.
01 CARD.
    05 CARD-NUM PIC X(8).
    05 PIC X.
    05 CARD-WINNING OCCURS 10 TIMES.
        10 WINNERS PIC 9(3).
    05 PIC X(2).
    05 CARD-DRAWN OCCURS 25 TIMES.
        10 DRAW PIC 9(3).
    05 PIC X.

WORKING-STORAGE SECTION.
77 WS-WINNER-I PIC 99.
77 WS-DRAW-I PIC 99.
77 WS-EOF PIC A VALUE 'N'.
    88 WS-DONE VALUE 'Y'.
77 WS-POINTS PIC 9(8).
77 WS-MATCH-COUNTER PIC 9(8).
77 WS-SUM PIC 9(8) VALUE ZEROS.

PROCEDURE DIVISION.
MAIN-PARA.
    OPEN INPUT DAY4DATA.
        PERFORM UNTIL WS-DONE
            READ DAY4DATA
                AT END SET WS-DONE TO TRUE
                NOT AT END
                INSPECT CARD REPLACING ALL SPACES BY ZEROS
                PERFORM INTERSECT-PARA
                ADD WS-POINTS TO WS-SUM
            END-READ
        END-PERFORM
    CLOSE DAY4DATA
    DISPLAY WS-SUM
    STOP RUN.
INTERSECT-PARA.
    MOVE 1 TO WS-WINNER-I
    MOVE 1 TO WS-DRAW-I
    MOVE ZEROS TO WS-MATCH-COUNTER
    MOVE ZEROS TO WS-POINTS

    PERFORM UNTIL WS-WINNER-I > 10
        PERFORM UNTIL WS-DRAW-I > 25
            IF WINNERS(WS-WINNER-I) = DRAW(WS-DRAW-I)
                ADD 1 TO WS-MATCH-COUNTER
                IF WS-MATCH-COUNTER > 1
                    COMPUTE WS-POINTS = WS-POINTS * 2
                ELSE
                    IF WS-MATCH-COUNTER = 1
                        MOVE 1 TO WS-POINTS
                    END-IF
                END-IF
            END-IF
            ADD 1 TO WS-DRAW-I
        END-PERFORM

        MOVE ZERO TO WS-DRAW-I
        ADD 1 TO WS-WINNER-I
    END-PERFORM.
